In [1]:
import seaborn as sns
import matplotlib.pyplot as mpl
import pandas as pd

In [32]:
#test

In [17]:
i = "toto"

In [3]:
a, b = 1, 2

In [5]:
a

1

In [19]:
type(i)

str

In [30]:
for a in i :
    print(a)

t
o
t
o

In [22]:
l1 = []

In [23]:
l2 = list()

In [37]:
l3 = [x for x in range(10)]

In [26]:
[x for x in range(10) if x%2==0]

[0, 2, 4, 6, 8]

In [33]:
# !pip list

In [38]:
l3

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [41]:
s = pd.Series(l3)

In [42]:
s.mean()

4.5

In [44]:
s.describe()

count    10.00000
mean      4.50000
std       3.02765
min       0.00000
25%       2.25000
50%       4.50000
75%       6.75000
max       9.00000
dtype: float64

In [55]:
var = sns.load_dataset('tips')

In [56]:
var

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [50]:
df = pd.read_csv('../../data/prices.csv') #Permet de lire un fichier .csv

In [54]:
df

,Unnamed: 0,ID,day,created,available,local_currency,local_price,min_nights
0,3502203,13170204,2018-12-29,2018-09-26 19:30:07.000+0000,True,EUR,23,30
1,307902,27132220,2018-11-11,2018-09-26 19:40:24.000+0000,False,EUR,177,2
2,3861426,28426717,2018-11-07,2018-09-26 19:38:04.000+0000,False,EUR,73,3
3,1333025,20583341,2018-10-26,2018-09-26 15:09:46.000+0000,False,EUR,175,2
4,3804978,3800777,2019-01-02,2018-09-27 06:06:25.000+0000,False,EUR,68,3
...,...,...,...,...,...,...,...,...
299995,4080371,21988141,2018-10-01,2018-09-27 10:42:36.000+0000,False,EUR,175,91
299996,64951,2755601,2018-08-31,2018-09-27 10:44:32.000+0000,False,EUR,59,7
299997,1502481,17665685,2018-10-07,2018-09-27 10:50:23.000+0000,False,EUR,52,3
299998,1430474,5814961,2018-12-27,2018-09-27 10:39:54.000+0000,True,EUR,764,1
299999,800605,22225463,2018-09-22,2018-09-27 06:17:42.000+0000,True,EUR,129,2